app/Controllers/Admin.php

SELECT *
FROM `t_products`
---
    public function products()
    {
        $categoryModel = new ProductsModel();
        $data['categories'] = $categoryModel->findAll();

INSERT INTO `t_gallery` (`img`, `is_active`, `is_show_home`, `kategori`) VALUES ('1719543432_70b3e40f217d54158960.jpeg', 0, 0, 'Grand Opening')
---
    public function save_gallery()
    {
        $model = new GalleryModel();
        $file = $this->request->getFile('file');

        if ($file && $file->isValid() && !$file->hasMoved()) {
            $imgName = $file->getRandomName();
            $file->move('uploads/gallery/', $imgName);

            $data = [
                'img' => $imgName,
                'is_active' => $this->request->getPost('status') === 'active' ? 1 : 0,
                'is_show_home' => $this->request->getPost('show_home') === 'show' ? 1 : 0,
                'kategori' => $this->request->getPost('kategori'),
            ];

            $model->insert($data);