app/Models/GalleryModel.php

SELECT *
FROM `t_gallery`
---
    public function getGallery($is_active = NULL, $is_show_home = NULL)
    {

        $builder = $this->db->table('t_gallery');

        if ($is_active != NULL) {
            $builder->where('is_active', $is_active);
        }

        if ($is_show_home != NULL) {
            $builder->where('is_show_home', $is_show_home);
        }
        return $builder->get()->getResultArray();

SELECT DISTINCT `kategori`
FROM `t_gallery`
---
    public function getGalleryCategory()
    {
        $builder = $this->db->table('t_gallery');
        $builder->select('kategori');
        $builder->distinct();
        return $builder->get()->getResultArray();