app/Models/ProductsModel.php

SELECT *
FROM `t_products`
---
    public function getProducts($id = false)
    {
        if ($id === false) {
            return $this->findAll();