app/Models/SettingsModel.php

SELECT *
FROM `t_settings`
WHERE `parameter` = 'site-title'
---
    public function getSpecificSettings($parameters)
    {
        return $this->whereIn('parameter', $parameters)->findAll();