app/Models/SliderModel.php

SELECT *
FROM `t_slider`
---
    public function getSliders($id = null)
    {
        if ($id === null) {
            return $this->findAll();