app/Models/TestimonialsModel.php

SELECT *
FROM `t_testimoni`
WHERE `is_active` = 1
---
    public function getActiveTestimonials()
    {
        return $this->where('is_active', 1)->findAll();